dataframe.isnull()# 데이터 프레임이 비어있는지 여부

dataframe.dropna()#빈칸 있으면 없앤다. 데이터프레임은 테이블(표) 이름.

In [7]:
import pandas as pd
import numpy as np

A=pd.Series([2,4,6], index = [0,1,2]) #Series = 판다스 구성 기본단위
B=pd.Series([1,3,5], index = [1,2,3])
A+B
A.add(B,fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [8]:

print(A)
print(B)

A+B #각 인덱스 숫자에 맞게 더해짐. index0과 3은 더해질 숫자가 없기에 NaN으로 나옴.
    #결과값이 얼마가 나올지 모르기에 float값으로 소숫점도 같이 나옴.

0    2
1    4
2    6
dtype: int64
1    1
2    3
3    5
dtype: int64

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [10]:
#NaN지우기
A.add(B,fill_value=0)

#하나라도 있는 값을 내보냄.
#인덱스 0에는 A의 2가 있고 인덱스3에는 B의 5가 있음.

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

1.dropna : 제거 
    전체 데이터에 영향이 없거나 의미가 없을 때
2.평균 2,3,4,5,6,na,7,8,9 >> 2,3,4,5,6,average,7,8,9 
    평균에 영향을 안미침. na가 na이외의 숫자들의 평균으로 기입됨?

In [14]:
A=pd.DataFrame(np.random.randint(0,10,(2,2)), columns=list("AB"))
B=pd.DataFrame(np.random.randint(0,10,(3,3)), columns=list("BAC"))
print(A)
print()
print(B)

   A  B
0  5  9
1  6  3

   B  A  C
0  7  5  5
1  9  8  8
2  5  5  9

In [15]:
print(A+B)

      A     B   C
0  10.0  16.0 NaN
1  14.0  12.0 NaN
2   NaN   NaN NaN

In [16]:
A.add(B, fill_value = 0) #A와 B를 더하는데 더하지 않는 값을 채워라(fill_value = 0)
#outer join cf.default = inner join

      A     B    C
0  10.0  16.0  5.0
1  14.0  12.0  8.0
2   5.0   5.0  9.0

In [19]:
data = {
    'A' : [i+5 for i in range(3)],
    'B' : [i**2 for i in range(3)]    
}
print(data)

{'A': [5, 6, 7], 'B': [0, 1, 4]}

In [20]:
pd.DataFrame(data)

   A  B
0  5  0
1  6  1
2  7  4

In [21]:
df =pd.DataFrame(data) #pd.DataFrame(data) 이거 다 쓰기 길어서 df로 줄임

In [22]:
df.A

0    5
1    6
2    7
Name: A, dtype: int64

In [24]:
df.sum() #A속성과 B속성의 합

A    18
B     5
dtype: int64

In [25]:
df.mean()

A    6.000000
B    1.666667
dtype: float64

강제적으로 Na를 생성할 때 넘파이를 불러와야 함.
sort_values('데이터 이름#아래기준 col1#')하면 오름차순 정렬
리버스(트루)하면 반대로 내림차순 정렬
ascending=true 하면 오름차순
ascending=false 하면 내림차순

In [30]:
a=pd.DataFrame({
    'col1':[2,1,9,8,7,4],
    'col2':['A','A','B',np.nan,'D','C'],
    'col3':[0,1,9,4,2,3],
})
print(a)

   col1 col2  col3
0     2    A     0
1     1    A     1
2     9    B     9
3     8  NaN     4
4     7    D     2
5     4    C     3

In [33]:
df=pd.DataFrame(a)
df

   col1 col2  col3
0     2    A     0
1     1    A     1
2     9    B     9
3     8  NaN     4
4     7    D     2
5     4    C     3

In [34]:
df.sort_values('col1')

   col1 col2  col3
1     1    A     1
0     2    A     0
5     4    C     3
4     7    D     2
3     8  NaN     4
2     9    B     9